In [1]:
import pandas as pd

In [2]:
wheather_data = [('1/1/24' , 32 , 6 , 'Rain'),
                ('1/2/24' , 35 , 3 , 'Sunny'),
                ('1/3/24' , 38 , 5 , 'Snow'),
                ('1/4/24' , 39 , 7 , 'Rain'),
                ('1/5/24' , 37 , 9 , 'Sunny')]
df = pd.DataFrame(wheather_data , columns = ['Date' , 'Temperature' , 'Windspeed' , 'Climate'])
df

     Date  Temperature  Windspeed Climate
0  1/1/24           32          6    Rain
1  1/2/24           35          3   Sunny
2  1/3/24           38          5    Snow
3  1/4/24           39          7    Rain
4  1/5/24           37          9   Sunny

# Read and write in a csv and xls files

In [3]:
# dataframe to csv

df.to_csv('new.csv')
df.to_csv('new.csv' , index = False)

In [4]:
# df to excel

df.to_excel('new.xlsx' , sheet_name = 'wheather_data')   # sheet name is used to specify the sheet from all other sheets

In [5]:
# creating dataset .... list of tuples

wheather_data = [('1/1/24' , 32 , 6 , 'Rain'),
                ('1/2/24' , 35 , 3 , 'Sunny'),
                ('1/3/24' , 38 , 5 , 'Snow'),
                ('1/4/24' , 39 , 7 , 'Rain'),
                ('1/5/24' , 37 , 9 , 'Sunny')]
df = pd.DataFrame(wheather_data , columns = ['Date' , 'Temperature' , 'Windspeed' , 'Climate'])
df

     Date  Temperature  Windspeed Climate
0  1/1/24           32          6    Rain
1  1/2/24           35          3   Sunny
2  1/3/24           38          5    Snow
3  1/4/24           39          7    Rain
4  1/5/24           37          9   Sunny

In [6]:
g = df.groupby('Climate')
g

In [7]:
for city,city_df in g:
    print(city)
    print(city_df)

Rain
     Date  Temperature  Windspeed Climate
0  1/1/24           32          6    Rain
3  1/4/24           39          7    Rain
Snow
     Date  Temperature  Windspeed Climate
2  1/3/24           38          5    Snow
Sunny
     Date  Temperature  Windspeed Climate
1  1/2/24           35          3   Sunny
4  1/5/24           37          9   Sunny

In [8]:
# to get specific group

g.get_group('Sunny')

     Date  Temperature  Windspeed Climate
1  1/2/24           35          3   Sunny
4  1/5/24           37          9   Sunny

In [9]:
# find maximum temperature

print(g.max())

           Date  Temperature  Windspeed
Climate
Rain     1/4/24           39          7
Snow     1/3/24           38          5
Sunny    1/5/24           37          9

In [ ]:
print(g.mean())

In [11]:
print(g.describe())

        Temperature                                                 Windspeed  \
              count  mean       std   min    25%   50%    75%   max     count
Climate
Rain            2.0  35.5  4.949747  32.0  33.75  35.5  37.25  39.0       2.0
Snow            1.0  38.0       NaN  38.0  38.00  38.0  38.00  38.0       1.0
Sunny           2.0  36.0  1.414214  35.0  35.50  36.0  36.50  37.0       2.0


        mean       std  min   25%  50%   75%  max
Climate
Rain     6.5  0.707107  6.0  6.25  6.5  6.75  7.0
Snow     5.0       NaN  5.0  5.00  5.0  5.00  5.0
Sunny    6.0  4.242641  3.0  4.50  6.0  7.50  9.0

# Concatenate data frames

In [12]:
df

     Date  Temperature  Windspeed Climate
0  1/1/24           32          6    Rain
1  1/2/24           35          3   Sunny
2  1/3/24           38          5    Snow
3  1/4/24           39          7    Rain
4  1/5/24           37          9   Sunny

In [19]:
wheathers_data = pd.DataFrame({
    "date" :['1/6/24' , '1/7/24' , '1/8/24'],
    "Temperature" : [34,33,38],
    "Windspeed" : [10,8,5],
    "Climate" : ["Snow","Rain","Sunny"]
})

In [20]:
wheathers_data

     date  Temperature  Windspeed Climate
0  1/6/24           34         10    Snow
1  1/7/24           33          8    Rain
2  1/8/24           38          5   Sunny

In [22]:
# concatinating 2 data

pd.concat([wheather_data,wheathers_data])

     date  Temperature  Windspeed Climate
0  1/6/24           34         10    Snow
1  1/7/24           33          8    Rain
2  1/8/24           38          5   Sunny
0  1/6/24           34         10    Snow
1  1/7/24           33          8    Rain
2  1/8/24           38          5   Sunny

In [24]:
# concatinating 2 data with correct index

pd.concat([wheather_data,wheathers_data] , ignore_index=True)

     date  Temperature  Windspeed Climate
0  1/6/24           34         10    Snow
1  1/7/24           33          8    Rain
2  1/8/24           38          5   Sunny
3  1/6/24           34         10    Snow
4  1/7/24           33          8    Rain
5  1/8/24           38          5   Sunny

In [26]:
df = pd.concat([wheather_data,wheathers_data] , axis = 1)
df

,date,Temperature,Windspeed,Climate,date,Temperature,Windspeed,Climate
0,1/6/24,34,10,Snow,1/6/24,34,10,Snow
1,1/7/24,33,8,Rain,1/7/24,33,8,Rain
2,1/8/24,38,5,Sunny,1/8/24,38,5,Sunny

# Merge dataFrames

In [27]:
temperature_df = pd.DataFrame({
    "city" : ["mumbai" , 'delhi' , 'banglore' , 'hyderabad'],
    "temperature" : [32,45,30,40]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [28]:
humidity_df = pd.DataFrame({
    "city" : [ 'delhi' , "mumbai" , 'banglore'],
    "humidity" : [60,65,75]
})
humidity_df

       city  humidity
0     delhi        60
1    mumbai        65
2  banglore        75

In [32]:
# merge two dataframe without explicitely mention index

df = pd.merge(temperature_df, humidity_df , on='city')
df

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        60
2  banglore           30        75

In [34]:
# inner join  ->  default inner join

df = pd.merge(temperature_df, humidity_df , on='city', how = 'inner')
df

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        60
2  banglore           30        75

In [35]:
# outer join

df = pd.merge(temperature_df, humidity_df , on='city', how = 'outer')
df

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      60.0
2   banglore           30      75.0
3  hyderabad           40       NaN

# Numerical indexing (.loc vs iloc)
- .loc uses index to access<br>
- .iloc uses row number to access data<br>
- the difference we get only when we change the index by the user or else default iloc and loc are same

In [37]:
# default indexing

df = pd.DataFrame([1,2,3,4,5,6,7,8,9,10])
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [39]:
# user defined indexing

df = pd.DataFrame([1,2,3,4,5,6,7,8,9,10] , index = [49,48,47,46,45,1,2,3,4,5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   10

In [40]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [41]:
df.iloc[:2]

    0
49  1
48  2

In [42]:
df.loc[46]   # using index to accessing data

0    4
Name: 46, dtype: int64

In [45]:
df.iloc[3]    # using row number to access data

0    4
Name: 46, dtype: int64